Public Attributes | List of all members
API_StairHeadroomData Struct Reference
Element Manager API
Description of the Stair Headroom. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_HeadroomGenerationModeID  | headroomMethod
The type of room generation mode: APIHM_RightAngleToSlope or APIHM_VerticallyToSlope.
double  | headroomHeight
The height of the headroom.
double  | headroomLeftOffset
The offset of the headroom from the left side.
double  | headroomRightOffset
The offset of the headroom from the right side.
Detailed Description
Description of the Stair Headroom.
Member Data Documentation
◆ headroomHeight
 API_StairHeadroomData::headroomHeight
The height of the headroom.
◆ headroomLeftOffset
 API_StairHeadroomData::headroomLeftOffset
The offset of the headroom from the left side.
◆ headroomMethod
 API_StairHeadroomData::headroomMethod
The type of room generation mode: APIHM_RightAngleToSlope or APIHM_VerticallyToSlope.
◆ headroomRightOffset
 API_StairHeadroomData::headroomRightOffset
The offset of the headroom from the right side.